tg-bot/ШаблонБота/src/Catalogs/БонусыИШтрафы/БонусыИШтрафы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БонусыИШтрафы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЗолото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСеребро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штраф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

tg-bot/ШаблонБота/src/Catalogs/БонусыИШтрафы/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Знак = ?(ТекущиеДанные.Штраф, -1, 1);
	Значение = Новый Структура("Модификатор, СтоимостьЗолото, СтоимостьСеребро",
						ТекущиеДанные.Ссылка,
						ТекущиеДанные.СтоимостьЗолото * Знак,
						ТекущиеДанные.СтоимостьСеребро * Знак);
	ОповеститьОВыборе(Значение);
КонецПроцедуры
